docs/1c-export-2026-06-02/InformationRegisters/ViberИсторииСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ViberИсторииСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочтено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Напрвление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Viber_Направление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧатID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТокенСообщния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Непрочитаное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Видео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/СтатусДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрешон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/КонтактыViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтактыViber</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОбласти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/ПрикрепленныеФайлыViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПрикрепленныеФайлыViber</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/БизнесЛогикаViber/Ext/Module.bsl
#Область Старт_Вайбер_Бота

Функция ЗафиксироватьНовогоОтправителяИОтправитьТекстПриведствия(ДанныеЗапроса, НастройкиВайбер)Экспорт
	
	Контакт = ЗафиксироватьОтправителя(ДанныеЗапроса, НастройкиВайбер);
		
	Приведствие = ОтправитьТекстПриветствияНаВходВБот(Контакт, НастройкиВайбер);
		
	Возврат Приведствие; 

КонецФункции 

Функция ОтправитьТекстПриветствияНаВходВБот(Контакт, НастройкиВайбер)Экспорт
	
	ИмяМетода = "send_message";
	
	Клавиатура = Новый Структура;
	Кнопки = Новый Массив;
		   
	
	НазваниеКнопки = "ЗАРЕЄСТРУВАТИСЬ";
	Кнопка = Новый Структура;
	Кнопка.Вставить("TextSize","regular");
	Кнопка.Вставить("Text", НазваниеКнопки);
	Кнопка.Вставить("ActionType", "share-phone");
	Кнопка.Вставить("ActionBody", "phone_reply");
	Кнопка.Вставить("BgColor", "#00FF7F");
	Кнопки.Добавить(Кнопка);
	
	Клавиатура.Вставить("Type","keyboard");
	Клавиатура.Вставить("DefaultHeight", "false");
	Клавиатура.Вставить("Buttons",Кнопки);
	//Клавиатура.Вставить("InputFieldState","hidden");
		
	
	ТекстПриведствия = НастройкиВайбер.ТекстПриветствия;
	Текст = ЗаполнитьТекстПоШаблону(ТекстПриведствия, Контакт); 

	
	СтруктураОтвета = Новый Структура();
    СтруктураОтвета.Вставить("receiver", СокрЛП(Контакт.Идентификатор));	
	СтруктураОтвета.Вставить("sender", Новый Структура("name", НастройкиВайбер.ИмяОтправителя));
	СтруктураОтвета.Вставить("text", Текст);
	СтруктураОтвета.Вставить("type", "text");
	СтруктураОтвета.Вставить("min_api_version", 7);
	СтруктураОтвета.Вставить("keyboard", Клавиатура);
	
	Возврат ОбщегоНазначенияHTTPViber.ОтветJSON(СтруктураОтвета);
	
	//Ответ = МодульУправленияViber.ОтправитьЗапросViber(НастройкиВайбер, ИмяМетода, СтруктураОтвета);
	//
	//
	//
	//Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция ЗафиксироватьСтатусРазрешенияДиалога(ДанныеЗапроса, НастройкиВайбер)Экспорт
	
	Контакт = ЗафиксироватьСтатусДиалога(ДанныеЗапроса.user, НастройкиВайбер);
	ЗафиксироватьВходящееСообщение(ДанныеЗапроса, Контакт, НастройкиВайбер);
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет(); 
	
КонецФункции

Функция ЗафиксироватьСтатусОтпискиОтБота(ДанныеЗапроса, НастройкиВайбер)Экспорт
	
	Контакт = ПользовательОтписалсяОтБота(ДанныеЗапроса, НастройкиВайбер);
	ЗафиксироватьВходящееСообщение(ДанныеЗапроса, Контакт, НастройкиВайбер);
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции   
 
//////// входящие сообщения ////////////////////
Функция ОбработатьСообщение(ДанныеЗапроса, НастройкиВайбер)Экспорт 
	 
	Если ДанныеЗапроса.Свойство("sender") Тогда
		Контакт = ОбновитьОтправителя(ДанныеЗапроса.sender, НастройкиВайбер);
	КонецЕсли;
	
	Если НастройкиВайбер.ВестиИсториюПереписки Тогда
		ЗафиксироватьВходящееСообщение(ДанныеЗапроса, Контакт, НастройкиВайбер);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("message") Тогда
		Если ДанныеЗапроса.message.Свойство("text") Тогда
			Если ДанныеЗапроса.message.text = "phone_reply" Тогда
				ЗафиксироватьТелефонКонтактаИОтправитьТекст(Контакт, НастройкиВайбер, ДанныеЗапроса.message.contact.phone_number);
				Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
			ИначеЕсли Контакт.ЗапросОбласти Тогда
				ПодобратьМенеджераПоОбласти(ДанныеЗапроса.message, Контакт, НастройкиВайбер);
			КонецЕсли;
		//Иначе
		//	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();		
		КонецЕсли;
	КонецЕсли;	
			//
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();	
	
КонецФункции 

/////// статус прочтено ///////////////////////
Функция ЗафиксироватьСтатусПрочитано(ДанныеЗапроса, НастройкиВайбер)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт КАК Контакт,
		|	ViberИсторииСообщений.Дата КАК Дата,
		|	ViberИсторииСообщений.Напрвление КАК Напрвление,
		|	ViberИсторииСообщений.ЧатID КАК ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
		|	ViberИсторииСообщений.Картинка КАК Картинка,
		|	ViberИсторииСообщений.Файл КАК Файл,
		|	ViberИсторииСообщений.Видео КАК Видео,
		|	ViberИсторииСообщений.Текст КАК Текст,
		|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
		|	ViberИсторииСообщений.Размер КАК Размер,
		|	ViberИсторииСообщений.Наименование КАК Наименование,
		|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
		|	ViberИсторииСообщений.Доставлено КАК Доставлено,
		|	ViberИсторииСообщений.Прочтено КАК Прочтено
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.ТокенСообщния = &ТокенСообщния";
	
	Запрос.УстановитьПараметр("ТокенСообщния", СтрЗаменить(Строка(ДанныеЗапроса.message_token), Символ(160), ""));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Контакт             = ВыборкаДетальныеЗаписи.Контакт;
		Запись.Дата                = ВыборкаДетальныеЗаписи.Дата;
		Запись.Напрвление          = ВыборкаДетальныеЗаписи.Напрвление;
		Запись.ЧатID               = ВыборкаДетальныеЗаписи.ЧатID;
		Запись.ТокенСообщния       = ВыборкаДетальныеЗаписи.ТокенСообщния;
		Запись.ИсточникПривличения = ВыборкаДетальныеЗаписи.ИсточникПривличения;
		Запись.Картинка            = ВыборкаДетальныеЗаписи.Картинка;
		Запись.Файл                = ВыборкаДетальныеЗаписи.Файл;
		Запись.Видео               = ВыборкаДетальныеЗаписи.Видео;
		
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Прочтено = Истина;
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();

	
КонецФункции	

////// доставелно /////////////////////////////
Функция ЗафиксироватьСтатусДоставлено(ДанныеЗапроса, НастройкиВайбер)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт КАК Контакт,
		|	ViberИсторииСообщений.Дата КАК Дата,
		|	ViberИсторииСообщений.Напрвление КАК Напрвление,
		|	ViberИсторииСообщений.ЧатID КАК ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния КАК ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения КАК ИсточникПривличения,
		|	ViberИсторииСообщений.Картинка КАК Картинка,
		|	ViberИсторииСообщений.Файл КАК Файл,
		|	ViberИсторииСообщений.Видео КАК Видео,
		|	ViberИсторииСообщений.Текст КАК Текст,
		|	ViberИсторииСообщений.ПутьКФайлу КАК ПутьКФайлу,
		|	ViberИсторииСообщений.Размер КАК Размер,
		|	ViberИсторииСообщений.Наименование КАК Наименование,
		|	ViberИсторииСообщений.ФайлВБазе КАК ФайлВБазе,
		|	ViberИсторииСообщений.Доставлено КАК Доставлено,
		|	ViberИсторииСообщений.Прочтено КАК Прочтено
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.ТокенСообщния = &ТокенСообщния";
	
	Запрос.УстановитьПараметр("ТокенСообщния", СтрЗаменить(Строка(ДанныеЗапроса.message_token), Символ(160), ""));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Контакт             = ВыборкаДетальныеЗаписи.Контакт;
		Запись.Дата                = ВыборкаДетальныеЗаписи.Дата;
		Запись.Напрвление          = ВыборкаДетальныеЗаписи.Напрвление;
		Запись.ЧатID               = ВыборкаДетальныеЗаписи.ЧатID;
		Запись.ТокенСообщния       = ВыборкаДетальныеЗаписи.ТокенСообщния;
		Запись.ИсточникПривличения = ВыборкаДетальныеЗаписи.ИсточникПривличения;
		Запись.Картинка            = ВыборкаДетальныеЗаписи.Картинка;
		Запись.Файл                = ВыборкаДетальныеЗаписи.Файл;
		Запись.Видео               = ВыборкаДетальныеЗаписи.Видео;
		
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Доставлено = Истина;
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();		
	
КонецФункции	





 #КонецОбласти
 
 
#Область Общие_Процедуры_И_Функции

Функция ЗафиксироватьОтправителя(ДанныеОтправителя, НастройкиВайбер) 

	//ОтправитьДоплнительныеДействия = Ложь;
	
	Идентификатор = Строка(СокрЛП(ДанныеОтправителя.id));
	
	УчетнаяЗапись = Справочники.КонтактыViber.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если УчетнаяЗапись = Справочники.КонтактыViber.ПустаяСсылка() Тогда
		СпрОбъект = Справочники.КонтактыViber.СоздатьЭлемент();
		ОтправитьДоплнительныеДействия = Истина;
	Иначе
		СпрОбъект = УчетнаяЗапись.ПолучитьОбъект();
	КонецЕсли;	

	Если ДанныеОтправителя.Свойство("name") Тогда
		ИмяПользователя = ДанныеОтправителя.name;
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("avatar") Тогда
		Фото = ДанныеОтправителя.avatar;
	КонецЕсли; 
	
	СпрОбъект.Идентификатор  = Идентификатор;	
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Фото = Фото;
	СпрОбъект.Подписан = Ложь;
	СпрОбъект.ДатаРегистрации = ТекущаяДатаСеанса();
	СпрОбъект.СтатусДиалога = Перечисления.СтатусДиалога.Запрещен;
	СпрОбъект.ИсточникПривличения = НастройкиВайбер;
	
	СпрОбъект.Записать();
	
	//Если ОтправитьДоплнительныеДействия Тогда
	//	Запись = РегистрыСведений.ДополнительныеДействияВайбер.СоздатьМенеджерЗаписи();
	//	Запись.Контакт = СпрОбъект.Ссылка;
	//	Запись.Дата    = ТекущаяДата();
	//	Запись.Текст   = ПолучитьТекстКлиентНеВыбралДействия();
	//	Запись.Записать();
	//	
	//КонецЕсли;	
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

Функция ОбновитьОтправителя(ДанныеОтправителя, НастройкиВайбер)
	
	Идентификатор = Строка(СокрЛП(ДанныеОтправителя.id));
	
	УчетнаяЗапись = Справочники.КонтактыViber.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если УчетнаяЗапись = Справочники.КонтактыViber.ПустаяСсылка() Тогда
		СпрОбъект = Справочники.КонтактыViber.СоздатьЭлемент();
	Иначе
		СпрОбъект = УчетнаяЗапись.ПолучитьОбъект();
	КонецЕсли;	

	Если ДанныеОтправителя.Свойство("name") Тогда
		ИмяПользователя = ДанныеОтправителя.name;
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("avatar") Тогда
		Фото = ДанныеОтправителя.avatar;
	КонецЕсли; 
	
	СпрОбъект.Идентификатор  = Идентификатор;	
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Фото = Фото;
	СпрОбъект.Подписан = Истина;
	Если Не ЗначениеЗаполнено(СпрОбъект.ДатаРегистрации) Тогда
		СпрОбъект.ДатаРегистрации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпрОбъект.ДатаПодписки) Тогда
		СпрОбъект.ДатаПодписки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СпрОбъект.Контрагент) И ЗначениеЗаполнено(СпрОбъект.Телефон) Тогда
		СпрОбъект.Контрагент =  ПолучитьКонтрагентаПоНомеруТелефона(СпрОбъект.Телефон);
		Если ЗначениеЗаполнено(СпрОбъект.Контрагент) Тогда
			СпрОбъект.Менеджер = СпрОбъект.Контрагент.ТорговыйАгент;
		КонецЕсли;	
	КонецЕсли;	
	
	СпрОбъект.СтатусДиалога = Перечисления.СтатусДиалога.Разрешон;
	СпрОбъект.ИсточникПривличения = НастройкиВайбер;
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;

	
	
КонецФункции

Функция ЗафиксироватьСтатусДиалога(ДанныеОтправителя, НастройкиВайбер) 
	
	Идентификатор = Строка(СокрЛП(ДанныеОтправителя.id));
	
	УчетнаяЗапись = Справочники.КонтактыViber.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если УчетнаяЗапись = Справочники.КонтактыViber.ПустаяСсылка() Тогда
		СпрОбъект = Справочники.КонтактыViber.СоздатьЭлемент();
	Иначе
		СпрОбъект = УчетнаяЗапись.ПолучитьОбъект();
	КонецЕсли;	

	Если ДанныеОтправителя.Свойство("name") Тогда
		ИмяПользователя = ДанныеОтправителя.name;
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("avatar") Тогда
		Фото = ДанныеОтправителя.avatar;
	КонецЕсли; 
	
	СпрОбъект.Идентификатор  = Идентификатор;	
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Подписан     = Истина;
	СпрОбъект.Фото = Фото;
	СпрОбъект.ДатаПодписки = ТекущаяДатаСеанса();
	СпрОбъект.СтатусДиалога = Перечисления.СтатусДиалога.Разрешон;
	СпрОбъект.ИсточникПривличения = НастройкиВайбер;
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;	
	
	
	
КонецФункции	

Функция ЗаполнитьТекстПоШаблону(Текст, Контакт)
	
	ТекстДляОтправки = СтрЗаменить(Текст, "[Покупатель.Наименование]", Контакт.Наименование);
	
	Возврат ТекстДляОтправки;  
	
КонецФункции	

Функция ПользовательОтписалсяОтБота(ДанныеЗапроса, НастройкиВайбер)
	
	Идентификатор = ДанныеЗапроса.user_id;
	
	УчетнаяЗапись = Справочники.КонтактыViber.НайтиПоРеквизиту("Идентификатор",(СокрЛП(Идентификатор)));
	Если НЕ УчетнаяЗапись = Справочники.КонтактыViber.ПустаяСсылка() Тогда
		СпрОбъект = УчетнаяЗапись.ПолучитьОбъект();
	КонецЕсли;
	
	СпрОбъект.СтатусДиалога = Перечисления.СтатусДиалога.Запрещен;
	СпрОбъект.Подписан = Ложь;
	
	СпрОбъект.ДатаОтписки = ТекущаяДатаСеанса(); 
	
	Если Не ЗначениеЗАполнено(СпрОбъект.ИсточникПривличения) Тогда
		СпрОбъект.ИсточникПривличения = НастройкиВайбер;
	КонецЕсли;	
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

Процедура ЗафиксироватьВходящееСообщение(ДанныеЗапроса, Контакт, НастройкиВайбер)
	
	Спр = Контакт.ПолучитьОбъект();
	Спр.НовоеСообщение = Истина;
	Спр.Записать();
	
	
	НовоеСообщение = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
	НовоеСообщение.Контакт = Контакт;
	НовоеСообщение.Напрвление = Перечисления.Viber_Направление.Входящее;
	НовоеСообщение.Дата = ТекущаяДатаСеанса();
	НовоеСообщение.ИсточникПривличения = НастройкиВайбер;
	НовоеСообщение.Непрочитаное = истина;
	
	
	Если ДанныеЗапроса.Свойство("message") Тогда
		Если ДанныеЗапроса.message.type = "text" Тогда
			НовоеСообщение.Текст = ДанныеЗапроса.message.text;
		ИначеЕсли ДанныеЗапроса.message.type = "picture" Тогда
			НовоеСообщение.Текст        = ДанныеЗапроса.message.thumbnail;
			
			ФайлВБазе = ЗафиксироватьВходящийФайл(Контакт, ДанныеЗапроса.message.file_name,  ДанныеЗапроса.message.media);
			Если ЗначениеЗаполнено(ФайлВБазе) Тогда
				НовоеСообщение.ПутьКФайлу   = ФайлВБазе;
			Иначе
				НовоеСообщение.ПутьКФайлу   = ДанныеЗапроса.message.media;
			КонецЕсли;	
			НовоеСообщение.Размер       = ДанныеЗапроса.message.size;
			НовоеСообщение.Наименование = ДанныеЗапроса.message.file_name;
			НовоеСообщение.Картинка     = Истина;
			
		ИначеЕсли ДанныеЗапроса.message.type = "file" Тогда
			НовоеСообщение.Текст        = ДанныеЗапроса.message.media;
			ФайлВБазе = ЗафиксироватьВходящийФайл(Контакт, ДанныеЗапроса.message.file_name,  ДанныеЗапроса.message.media);
			Если ЗначениеЗаполнено(ФайлВБазе) Тогда
				НовоеСообщение.ПутьКФайлу   = ФайлВБазе;
			Иначе
				НовоеСообщение.ПутьКФайлу   = ДанныеЗапроса.message.media;
			КонецЕсли;
			
			НовоеСообщение.Размер       = ДанныеЗапроса.message.size;
			НовоеСообщение.Наименование = ДанныеЗапроса.message.file_name;
			НовоеСообщение.Файл         = Истина;  
		ИначеЕсли ДанныеЗапроса.message.type = "video" Тогда
			НовоеСообщение.Текст        = ДанныеЗапроса.message.thumbnail;
			НовоеСообщение.ПутьКФайлу   = ДанныеЗапроса.message.media;
			НовоеСообщение.Размер       = ДанныеЗапроса.message.size;
			НовоеСообщение.Наименование = ДанныеЗапроса.message.file_name;
			НовоеСообщение.Видео        = Истина; 
		ИначеЕсли ДанныеЗапроса.message.type = "contact" Тогда
			Если ДанныеЗапроса.message.text = "phone_reply" Тогда 
				НовоеСообщение.Текст        = ДанныеЗапроса.message.contact.phone_number;
			КонецЕсли;
    	КонецЕсли;			
	ИначеЕсли
		ДанныеЗапроса.event = "subscribed" Тогда
		НовоеСообщение.Текст = "Пользователь разрешил получать сообщения";
	ИначеЕсли
		ДанныеЗапроса.event = "unsubscribed" Тогда	
		НовоеСообщение.Текст = "Пользователь отписался и запретил получать уведомления";
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("chat_hostname") Тогда
		НовоеСообщение.ЧатID = ДанныеЗапроса.chat_hostname;
	КонецЕсли; 
	
	Если ДанныеЗапроса.Свойство("message_token") Тогда
		НовоеСообщение.ТокенСообщния = ДанныеЗапроса.message_token;
	КонецЕсли; 
	
	

	НовоеСообщение.Записать();
	
	
	
КонецПроцедуры

Функция ЗафиксироватьВходящийФайл(Контакт, Наименование, Путь)
	
	ФайлНаСервере = "";
	
	Если ЗначениеЗаполнено(Путь) Тогда
		
		МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Наименование, ".");
		Расш = МассивИмен[МассивИмен.Количество() - 1];    
		
		ФайлТут = ПолучитьИмяВременногоФайла(Расш);
	
		КопироватьФайл(Путь, ФайлТут);

		ГруппаФайла = ПолучитьГруппуФайла(Контакт);
		
		Спр = Справочники.ПрикрепленныеФайлыViber.СоздатьЭлемент();
		Спр.Наименование = Наименование;
		Спр.Путь = Путь;
		Спр.Контакт = Контакт;
		Спр.ДатаСоздания = ТекущаяДатаСеанса();
		Спр.Родитель     = ГруппаФайла;
		
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлТут));
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		Спр.Изображение   = Новый ХранилищеЗначения(Данные);
		
		Спр.Записать();
		
		
		ФайлВБазе = "C:\Apache24\htdocs\file\" + Наименование;
		КопироватьФайл(ФайлТут, ФайлВБазе);
		ФайлНаСервере = "https://ltex1c.com.ua/file/" + Наименование;
		
		УдалитьИзВременногоХранилища(Адрес);
		УдалитьФайлы(ФайлТут);

	КонецЕсли;
	
	Возврат ФайлНаСервере;
	
КонецФункции

Функция ПолучитьГруппуФайла(Контакт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикрепленныеФайлыViber.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПрикрепленныеФайлыViber КАК ПрикрепленныеФайлыViber
		|ГДЕ
		|	ПрикрепленныеФайлыViber.ЭтоГруппа = ИСТИНА
		|	И ПрикрепленныеФайлыViber.Контакт = &Контакт";
	
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Спр = Справочники.ПрикрепленныеФайлыViber.СоздатьГруппу();
		Спр.Наименование = Контакт.Наименование;
		Спр.Контакт      = Контакт;
		Спр.Записать();
		Возврат Спр.Ссылка;
		
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьТекстКлиентНеВыбралДействия()

	Текст = "Напишіть будь ласка, що саме вас цікавить?" + Символы.ПС;
	
	//Текст = Текст + "↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓";
	
	Возврат Текст;
	
	
КонецФункции	





///// команды чат бот /////////////////////////
Процедура ЗафиксироватьТелефонКонтактаИОтправитьТекст(Контакт, НастройкиВайбер, Телефон)
	
	ЗарегистрироватьДоп = Ложь;
	
	СпрОбъект = Контакт.ПолучитьОбъект();
	СпрОбъект.Телефон = Телефон;
	//СпрОбъект.Контрагент = ПолучитьКонтрагентаПоНомеруТелефона(Телефон);
	СпрОбъект.СтатусДиалога = Перечисления.СтатусДиалога.Разрешон;
	СпрОбъект.ДатаПодписки  = ТекущаяДатаСеанса();
	СпрОбъект.Подписан      = Истина;
	СпрОбъект.ИсточникПривличения = НастройкиВайбер;
	СпрОбъект.Контрагент    = ПолучитьКонтрагентаПоНомеруТелефона(Телефон);
	Если ЗначениеЗаполнено(СпрОбъект.Контрагент) Тогда
		СпрОбъект.Область = СпрОбъект.Контрагент.Область;
	КонецЕсли;	
	СпрОбъект.Записать(); 
	
	Клавиатура = Новый Структура;
	Кнопки = Новый Массив;
		   
	Если Не ЗначениеЗаполнено(Контакт.Контрагент) Тогда	
		СписокКоманд = ПолучитьСписокКоманд();
		Сп = СпрОбъект.Ссылка.ПолучитьОбъект();
		Сп.ЗапросОбласти = Истина;
		Сп.Записать();
		
		Если ЗначениеЗаполнено(СписокКоманд) Тогда
			Для Каждого Строка Из СписокКоманд Цикл
				НазваниеКнопки = Строка(Строка);
				Кнопка = Новый Структура;
				Кнопка.Вставить("Columns", 3);
				Кнопка.Вставить("Rows", 1);
				Кнопка.Вставить("TextSize","regular");
				Кнопка.Вставить("Text", НазваниеКнопки);
				Кнопка.Вставить("ActionType", "reply");
				Кнопка.Вставить("ActionBody", Строка(Строка));
				Кнопка.Вставить("BgColor", "#87CEEB");
				Кнопки.Добавить(Кнопка);
			КонецЦикла;
			
			Клавиатура.Вставить("Type","keyboard");
			Клавиатура.Вставить("DefaultHeight", "false");
			Клавиатура.Вставить("Buttons", Кнопки);	
		КонецЕсли;	
		
		Текст = "З якої Ви області?" + Символы.ПС + "Виберіть з наведених варіантів.";
	Иначе
		Текст = "Дякуємо за реєстрацію!" + Символы.ПС + Символы.ПС + "Менеджер зв'яжеться з Вами найближчим часом.";
		ЗарегистрироватьДоп = Истина;
	КонецЕсли;	

	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", НастройкиВайбер.ИмяОтправителя));
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Контакт.Идентификатор));
	СтруктураЗапроса.Вставить("text", Текст);
	СтруктураЗапроса.Вставить("type", "text");
	СтруктураЗапроса.Вставить("min_api_version", 7);
	
	Если ЗначениеЗАполнено(Клавиатура) Тогда
		СтруктураЗапроса.Вставить("keyboard", Клавиатура);
	КонецЕсли;	

	Ответ = МодульУправленияViber.ОтправитьЗапросViber(НастройкиВайбер, ИмяМетода, СтруктураЗапроса);
	
	Если ЗарегистрироватьДоп Тогда
		ЗафиксироватьДополнительнуюФункциюВайбер(Контакт, НастройкиВайбер);
	
	КонецЕсли;	
	
КонецПроцедуры	

/////получить менеджера по області //////////////
Процедура ПодобратьМенеджераПоОбласти(Сообщение, Контакт, НастройкиВайбер)
	
	ТекстПоиска = "%" + СокрЛП(Сообщение.text) + "%";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеАгенты.Ссылка
		|ИЗ
		|	Справочник.ТорговыеАгенты КАК ТорговыеАгенты
		|ГДЕ
		|	ТорговыеАгенты.Область ПОДОБНО &Область
		|	И НЕ ТорговыеАгенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Область", ТекстПоиска);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Спр = Контакт.ПолучитьОбъект();
		Спр.ЗапросОбласти = Ложь;
		Спр.Менеджер = РезультатЗапроса[0].Ссылка;
		Спр.Записать();
	Иначе
		Спр = Контакт.ПолучитьОбъект();
		Спр.ЗапросОбласти = Ложь;
		Спр.Записать();
	КонецЕсли;
	
	Текст = "Дякуємо за реєстрацію!" + Символы.ПС + Символы.ПС + "Ваш менеджер зв'яжеться з Вами найближчим часом.";
		

	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", НастройкиВайбер.ИмяОтправителя));
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Контакт.Идентификатор));
	СтруктураЗапроса.Вставить("text", Текст);
	СтруктураЗапроса.Вставить("type", "text");
	СтруктураЗапроса.Вставить("min_api_version", 7);
	
	Ответ = МодульУправленияViber.ОтправитьЗапросViber(НастройкиВайбер, ИмяМетода, СтруктураЗапроса);  
	
	
	ЗафиксироватьДополнительнуюФункциюВайбер(Контакт, НастройкиВайбер); 	
	
КонецПроцедуры	

///// получить контрагента по телефону /////////////////////////
Функция ПолучитьКонтрагентаПоНомеруТелефона(Телефон)
	
	ТелефонПоиска = "%" + Прав(СтрЗаменить(Телефон, Символ(160), ""), 9) + "%";
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.НомерТелефона ПОДОБНО &НомерТелефона";
	
	Запрос.УстановитьПараметр("НомерТелефона", ТелефонПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов
		|ГДЕ
		|	КонтрагентыДополнительныеНомераТелефонов.Номер ПОДОБНО &Номер";
	
	Запрос.УстановитьПараметр("Номер", ТелефонПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
	
КонецФункции	






////// получить список команд ////////////////////
Функция ПолучитьСписокКоманд()
	
	КнопкаСтрокой = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеАгенты.Область
		|ИЗ
		|	Справочник.ТорговыеАгенты КАК ТорговыеАгенты
		|ГДЕ
		|	НЕ ТорговыеАгенты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Область) Тогда
			КнопкаСтрокой = "" + КнопкаСтрокой + ВыборкаДетальныеЗаписи.Область + ",";
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КнопкаСтрокой) Тогда
		КнопкаСтрокой = СтрЗаменить(КнопкаСтрокой, " ", "");
		
		СписокКнопок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КнопкаСтрокой, ",");
		Возврат СписокКнопок;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции	





Процедура ЗафиксироватьДополнительнуюФункциюВайбер(Контакт, Настройка)
	
	//Если ОтправитьДоплнительныеДействия Тогда
		Запись = РегистрыСведений.ДополнительныеДействияВайбер.СоздатьМенеджерЗаписи();
		Запись.Контакт = Контакт;
		Запись.Дата    = ТекущаяДата();
		Запись.Текст   = ПолучитьТекстКлиентНеВыбралДействия();
		Запись.Настройка = Настройка;
		Запись.Записать();
		
	//КонецЕсли;
	
	
КонецПроцедуры	

/// отправить дополнительные действия Вайбер ////////////////////////
Процедура ОтправитьДополнительныеДействияВайбер() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеДействияВайбер.Контакт,
		|	ДополнительныеДействияВайбер.Дата,
		|	ДополнительныеДействияВайбер.Текст,
		|	ДополнительныеДействияВайбер.Настройка
		|ИЗ
		|	РегистрСведений.ДополнительныеДействияВайбер КАК ДополнительныеДействияВайбер
		|ГДЕ
		|	ДополнительныеДействияВайбер.Отправлено = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТекущаяДата() - Выборка.Дата > 4 Тогда 
			Ответ = МодульУправленияViber.ОтправитьСообщениеПользователю(Выборка.Настройка, Выборка.Контакт, Выборка.Текст);
				
			Если Ответ.Свойство("status_message") Тогда
				Запись = РегистрыСведений.ДополнительныеДействияВайбер.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Запись.Отправлено = Истина;
					Запись.Записать();
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла; 
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательное

Процедура ВыполнитьОбновлениеСесиеСКонтактом()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Ссылка
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Контакт = ВыборкаДетальныеЗаписи.Ссылка;
		Если Контакт.СтатусДиалога = Перечисления.СтатусДиалога.Запрещен Тогда
			Если Контакт.ОстатокСесии <> 0 Тогда
				Спр = Контакт.ПолучитьОбъект();
				Спр.ОстатокСесии = 0;
				Спр.Записать();
			КонецЕсли;
		Иначе
			ОстатокСесии = ПолучитьВремяПоследнегоСообщения(Контакт);
			Если Контакт.ОстатокСесии <> ОстатокСесии Тогда
				Спр = Контакт.ПолучитьОбъект();
				Спр.ОстатокСесии = ОстатокСесии;
				Спр.Записать();
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВремяПоследнегоСообщения(Контакт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ViberИсторииСообщений.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.Контакт = &Контакт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДатаПоследнего = ВыборкаДетальныеЗаписи.Дата;
	
	Если ЗначениеЗаполнено(ДатаПоследнего) Тогда
		СрокОкончания = ДатаПоследнего + 24*60*60;
		РазницаДат = (СрокОкончания - ТекущаяДата()) / 3600;
	    ОстатокВремени = Окр(РазницаДат, 0, РежимОкругления.Окр15как10);
		
		Если ОстатокВремени > 24 ИЛИ ОстатокВремени < 0 Тогда
			Возврат 0;
		Иначе
			Возврат ОстатокВремени;
		КонецЕсли;		
		
		Возврат ОстатокВремени;
	КонецЕсли;
	
	Возврат 0; 	
	
КонецФункции	

Процедура ОбновлениеВремяСесийViber() Экспорт
	ВыполнитьОбновлениеСесиеСКонтактом();
КонецПроцедуры



#КонецОбласти
